wso2/iskm-register-app/scripts/serviceProviders/getOAuthApplicationDataByAppName.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://org.apache.axis2/xsd">
   <soap:Header/>
   <soap:Body>
      <xsd:getOAuthApplicationDataByAppName>
         <xsd:appName>@appname@</xsd:appName>
      </xsd:getOAuthApplicationDataByAppName>
   </soap:Body>
</soap:Envelope>